org/zettelkasten.org
#+SETUPFILE: ./hugo_setup.org
#+TITLE: Zettelkasten

- tags :: [[file:productivity.org][Productivity]], [[file:note_taking.org][Note-taking]]

* The original Zettelkasten Method

In the morning, Luhmann would take notes from his readings, penning
them down onto a piece of paper with a source inside.

In the evening, he would go through these notes and expand on them,
writing about how they impact his current studies.

* Indexes in Zettelkasten

Indexes have very few terms. They don't serve as a broad overview of a
topic, but more of an entry point.

* Zettelkasten Note Types

- fleeting :: notes taken as a reminder of what's in your head. These
  are to be removed after some time
  - In [[file:roam_research.org][Roam Research]] and [[file:org-roam.org][Org-Roam]], make fleeting notes in daily notes
- project-related :: notes related to a project
- permanent :: notes that are standalone, and make sense in their own context.

* Why Zettelkasten

1. Forces you to adopt a linking system: connect ideas, tangents
2. Break ideas up into smaller pieces, increase surface area for
   expansion

[[https://www.lesswrong.com/posts/NfdHG6oHBJ8Qxc26s/the-zettelkasten-method-1][The Zettelkasten Method - LessWrong 2.0]]
