content/zettels/zettelkasten.md
+++
title = "Zettelkasten"
author = ["Jethro Kuan"]
lastmod = 2020-02-13T17:47:18+08:00
draft = false
+++

tags
: [Productivity]({{< relref "productivity" >}}), [Note-taking]({{< relref "note_taking" >}})


## The original Zettelkasten Method {#the-original-zettelkasten-method}

In the morning, Luhmann would take notes from his readings, penning
them down onto a piece of paper with a source inside.

In the evening, he would go through these notes and expand on them,
writing about how they impact his current studies.


## Indexes in Zettelkasten {#indexes-in-zettelkasten}

Indexes have very few terms. They don't serve as a broad overview of a
topic, but more of an entry point.


## Zettelkasten Note Types {#zettelkasten-note-types}

fleeting
: notes taken as a reminder of what's in your head. These
    are to be removed after some time

project-related
: notes related to a project

permanent
: notes that are standalone, and make sense in their own context.


## Why Zettelkasten {#why-zettelkasten}

1.  Forces you to adopt a linking system: connect ideas, tangents
2.  Break ideas up into smaller pieces, increase surface area for expansion

[The Zettelkasten Method - LessWrong 2.0](https://www.lesswrong.com/posts/NfdHG6oHBJ8Qxc26s/the-zettelkasten-method-1)
